app/controllers/posts_controller.rb

    def index
      @posts = Post.all
---
SELECT "posts".* FROM "posts"

    def create
      @post = Post.new(post_params)

      if @post.save
---
INSERT INTO "posts" ("title", "content", "views", "likes", "category", "status", "slug", "published_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def destroy
      @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 4]]

    def set_post
      @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]